{
  "credentials": "Computer Enginner",
  "meta": {
    "description": "Knowledge is unserviceable if you can't share it.",
    "image": "/assets/profile.webp",
    "url": "https://brayantellez.com/en"
  },
  "content": {
    "header": "If I had to choose a set of words to describe myself, these would be:",
    "description": [
      {
        "strong": "Experimental",
        "text": "I'm a person who every time search improve itself and acquire new knowledge, learn old and new technologies, mixing, play with them."
      },
      {
        "strong": "Perfectionist",
        "text": "when I do something, do it in the better way that I can, this is grateful 'cause sure the quality of every work, however, it implicates put a significant time to do it."
      },
      {
        "strong": "Pragmatic",
        "text": "if there are a better way for the project or team is preferible use and work with it, if it's help us to agree with times or includes new members to team easily, well, we'll do it!."
      },
      {
        "strong": "Flexible",
        "text": "I have a great facility to get an adaptation to new environments and tasks, read docs, implement new things, refactor, etc. I enjoy the new challenges and the greattificant that it can result"
      },
      {
        "strong": "Funny",
        "text": "out of job environment, I'm someone use its time with activities like read, play video games, board games, basketball, etc. Make jokes is something that I do frequently and relax me and others."
      }
    ]
  },
  "skills": {
    "teach": "Passion for sharing knowledge.",
    "learn": "Enjoyment in learning new skills.",
    "talk": "Ease in communicating with others.",
    "empathy": "Ability to empathize and understand others.",
    "technology": "Understanding of digital technologies.",
    "idea": "Development and implementation of new ideas."
  },
  "hobbies": {
    "basketball": "I enjoy playing basketball in the afternoons and occasionally participate in local leagues.",
    "reading": "I love constantly reading different books; I particularly enjoy historical and science fiction novels.",
    "cooking": "Cooking is a relaxing and very enjoyable activity for me. Trying new dishes and mixing ingredients feels magical.",
    "coding": "I enjoy working on personal projects all the time, testing new technologies, and researching topics I'm passionate about."
  }
}