{
    "es": {
        "stages": [
            {
                "title": "Acerca de mi",
                "subtitle": "",
                "type": "text",
                "content": "Mi nombre es Brayan Téllez Cruz, actualmente tengo 20 años, nací en Enero de 2003 en el estado de Hidalgo, México, he estudiado, la educación básica en mi pueblo de origen, luego estudié la carrera de Técnico en Programación, en el Centro de Bachilleres Tecnológico, Industrial y de Servicios número 83 (CBTIS 83), en la localidad de Actopan, Hidalgo, México. A dia de hoy me encuentro cursando la carrera de Ingenieria en Sistemas Computacionales en la Universidad Nacional Autónoma de México (UNAM), en la Facultad de Ingeniería.<br>Soy una persona proactiva, que disfruta de la lectura y el estudio constante. Mi idioma nativo es el Español, además de tener un conocimiento intermedio de Inglés y básico de Chino."
            }
        ]
    },
    "en": {
        "stages": [
            {
                "title": "About me",
                "subtitle": "",
                "type": "text",
                "content": "My name is Brayan Téllez Cruz, currenly I'm 20 years old, I bear January 2003 on state Hidalgo, Mexico, I coursed my basic education on my origin town, then I studied the technical carrier of Programming at High School Center Technological, Industrial and of Services number 83 (CBTIS 83 by acronym in Spanish), on Actopan, Hidalgo, Mexico. At now I'm coursing carrier on Computacional System Engineering at National Autonomous University of Mexico (UNAM by acronym in Spanish), Faculty of Engineering,<br>I'm a proactive person, than enjoy to read and study constantly. My native language is Spanish, but also I know English in a middle level and Chinnese in a basic Level."
            }
        ]
    },
    "ch": {
        "stages": [
            {
                "title": "关于我",
                "subtitle": "",
                "type": "text",
                "content": "我叫 Brayan Téllez Cruz, 今年我二十岁了，我出生的一月二〇〇三年在 Hidalgo，墨西哥，我学习我的基础教育了在我的出生镇，然后我学习我的编程技术学位在技术、工业和服务学士中心八十三（CBTIS 83 西班牙语首字母缩略词）在 Actopan，Hidalgo，墨西哥。眼下我学习计算机系统工程在工程学部，UNAM大学。<br>我主动，我喜欢不断地看书，学习。我的母语是西班牙语，但我会说英语很好和汉语不很好。"
            }
        ]
    }
}